src/apersci/output/templates/request-deallocateInventory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://v4.core.coexprivate.api.shopatron.com">
   <soapenv:Header/>
   <soapenv:Body>
      <v4:deallocateInventory>
         <v4:request>
             <v4:FulfillerID>{{.FulfillerID}}</v4:FulfillerID>
            <v4:Items>{{range .Items}}
               <v4:items>
                   <v4:PartNumber>{{.PartNumber}}</v4:PartNumber>
                  <v4:UPC>{{.UPC}}</v4:UPC>
                  <v4:Quantity>{{.Quantity}}</v4:Quantity>
                  <v4:ExternalLocationID>{{.ExternalLocationID}}</v4:ExternalLocationID>
              </v4:items>{{end}}
            </v4:Items>
         </v4:request>
      </v4:deallocateInventory>
   </soapenv:Body>
</soapenv:Envelope>
